{"class_name": "Sequential", "keras_version": "1.0.7", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_col": 3, "input_dtype": "float32", "activation": "relu", "dim_ordering": "th", "border_mode": "same", "name": "convolution2d_1", "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "W_regularizer": null, "nb_filter": 32, "trainable": true, "batch_input_shape": [null, 1, 48, 48], "bias": true, "b_regularizer": null, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "glorot_uniform", "nb_col": 3, "activation": "relu", "dim_ordering": "th", "border_mode": "same", "name": "convolution2d_2", "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "W_regularizer": null, "nb_filter": 64, "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "init": "glorot_uniform", "nb_col": 3, "activation": "relu", "dim_ordering": "th", "border_mode": "same", "name": "convolution2d_3", "activity_regularizer": null, "nb_row": 3, "subsample": [1, 1], "W_regularizer": null, "nb_filter": 128, "trainable": true, "bias": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 512, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "name": "dense_1", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 128, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "name": "dense_2", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 32, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "b_regularizer": null, "name": "dense_3", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "b_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 7, "W_constraint": null, "init": "glorot_uniform", "activation": "softmax", "b_regularizer": null, "name": "dense_4", "activity_regularizer": null, "input_dim": null, "trainable": true, "bias": true, "b_constraint": null, "W_regularizer": null}}]}