{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "input_dtype": "float32", "batch_input_shape": [null, 1, 48, 48], "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "nb_row": 3, "W_constraint": null, "nb_filter": 32, "W_regularizer": null, "nb_col": 3, "border_mode": "same", "trainable": true, "activation": "relu", "dim_ordering": "th", "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "trainable": true, "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_row": 3, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_filter": 64, "W_regularizer": null, "nb_col": 3, "border_mode": "same", "trainable": true, "activation": "relu", "dim_ordering": "th", "bias": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2], "trainable": true, "dim_ordering": "th"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_row": 3, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "nb_filter": 128, "W_regularizer": null, "nb_col": 3, "border_mode": "same", "trainable": true, "activation": "relu", "dim_ordering": "th", "bias": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_3", "border_mode": "valid", "strides": [2, 2], "trainable": true, "dim_ordering": "th"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "output_dim": 512, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "relu", "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"name": "dense_2", "output_dim": 128, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "relu", "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"name": "dense_3", "output_dim": 32, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "relu", "bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"name": "dense_4", "output_dim": 7, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "W_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "softmax", "bias": true}}], "keras_version": "1.0.7"}