{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "nb_col": 3, "nb_filter": 32, "dim_ordering": "th", "bias": true, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "batch_input_shape": [null, 1, 48, 48], "trainable": true, "name": "convolution2d_1", "input_dtype": "float32", "activation": "elu", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_1", "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_2", "nb_filter": 64, "dim_ordering": "th", "bias": true, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "trainable": true, "nb_col": 3, "activation": "elu", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_2", "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_3", "nb_filter": 128, "dim_ordering": "th", "bias": true, "b_constraint": null, "activity_regularizer": null, "nb_row": 3, "trainable": true, "nb_col": 3, "activation": "elu", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "border_mode": "same", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "maxpooling2d_3", "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 4608, "W_constraint": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_1", "activation": "elu", "b_regularizer": null, "output_dim": 512, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"input_dim": 512, "W_constraint": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_2", "activation": "elu", "b_regularizer": null, "output_dim": 128, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"input_dim": 128, "W_constraint": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_3", "activation": "elu", "b_regularizer": null, "output_dim": 32, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"input_dim": 32, "W_constraint": null, "bias": true, "b_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_4", "activation": "softmax", "b_regularizer": null, "output_dim": 7, "W_regularizer": null, "init": "glorot_uniform"}}]}