{"config": [{"config": {"trainable": true, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_1", "dim_ordering": "th", "border_mode": "same", "subsample": [1, 1], "batch_input_shape": [null, 1, 48, 48], "input_dtype": "float32", "activity_regularizer": null, "activation": "elu", "nb_row": 3, "nb_filter": 32, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "border_mode": "valid", "dim_ordering": "th", "pool_size": [2, 2], "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "border_mode": "same", "subsample": [1, 1], "activation": "elu", "activity_regularizer": null, "name": "convolution2d_2", "nb_row": 3, "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "border_mode": "valid", "dim_ordering": "th", "pool_size": [2, 2], "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "border_mode": "same", "subsample": [1, 1], "activation": "elu", "activity_regularizer": null, "name": "convolution2d_3", "nb_row": 3, "nb_filter": 128, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "border_mode": "valid", "dim_ordering": "th", "pool_size": [2, 2], "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "th", "border_mode": "same", "subsample": [1, 1], "activation": "elu", "activity_regularizer": null, "name": "convolution2d_4", "nb_row": 3, "nb_filter": 256, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "border_mode": "valid", "dim_ordering": "th", "pool_size": [2, 2], "name": "maxpooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "elu", "activity_regularizer": null, "output_dim": 1024, "name": "dense_1", "input_dim": 2304, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "elu", "activity_regularizer": null, "output_dim": 512, "name": "dense_2", "input_dim": 1024, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_constraint": null, "init": "glorot_uniform", "activation": "softmax", "activity_regularizer": null, "output_dim": 7, "name": "dense_3", "input_dim": 512, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}